benchmarkResults/largepayload_messaging.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: benchmark.js
        output: -

     scenarios: (100.00%) 1 scenario, 25 max VUs, 1m0s max duration (incl. graceful stop):
              * largepayload_messaging: Up to 25 looping VUs for 30s over 3 stages (gracefulRampDown: 30s, exec: largePayloadMessaging, gracefulStop: 30s)


running (0m01.0s), 01/25 VUs, 288 complete and 0 interrupted iterations
largepayload_messaging   [   3% ] 01/25 VUs  01.0s/30.0s

running (0m02.0s), 03/25 VUs, 1576 complete and 0 interrupted iterations
largepayload_messaging   [   7% ] 03/25 VUs  02.0s/30.0s

running (0m03.0s), 05/25 VUs, 3325 complete and 0 interrupted iterations
largepayload_messaging   [  10% ] 05/25 VUs  03.0s/30.0s

running (0m04.0s), 07/25 VUs, 5767 complete and 0 interrupted iterations
largepayload_messaging   [  13% ] 07/25 VUs  04.0s/30.0s

running (0m05.0s), 09/25 VUs, 8688 complete and 0 interrupted iterations
largepayload_messaging   [  17% ] 09/25 VUs  05.0s/30.0s

running (0m06.0s), 11/25 VUs, 11900 complete and 0 interrupted iterations
largepayload_messaging   [  20% ] 11/25 VUs  06.0s/30.0s

running (0m07.0s), 12/25 VUs, 15327 complete and 0 interrupted iterations
largepayload_messaging   [  23% ] 12/25 VUs  07.0s/30.0s

running (0m08.0s), 14/25 VUs, 18994 complete and 0 interrupted iterations
largepayload_messaging   [  27% ] 14/25 VUs  08.0s/30.0s

running (0m09.0s), 15/25 VUs, 22861 complete and 0 interrupted iterations
largepayload_messaging   [  30% ] 15/25 VUs  09.0s/30.0s

running (0m10.0s), 17/25 VUs, 26912 complete and 0 interrupted iterations
largepayload_messaging   [  33% ] 17/25 VUs  10.0s/30.0s

running (0m11.0s), 18/25 VUs, 31103 complete and 0 interrupted iterations
largepayload_messaging   [  37% ] 18/25 VUs  11.0s/30.0s

running (0m12.0s), 20/25 VUs, 35437 complete and 0 interrupted iterations
largepayload_messaging   [  40% ] 20/25 VUs  12.0s/30.0s

running (0m13.0s), 21/25 VUs, 39914 complete and 0 interrupted iterations
largepayload_messaging   [  43% ] 21/25 VUs  13.0s/30.0s

running (0m14.0s), 23/25 VUs, 44487 complete and 0 interrupted iterations
largepayload_messaging   [  47% ] 23/25 VUs  14.0s/30.0s

running (0m15.0s), 24/25 VUs, 49123 complete and 0 interrupted iterations
largepayload_messaging   [  50% ] 24/25 VUs  15.0s/30.0s

running (0m16.0s), 25/25 VUs, 53797 complete and 0 interrupted iterations
largepayload_messaging   [  53% ] 25/25 VUs  16.0s/30.0s

running (0m17.0s), 25/25 VUs, 58529 complete and 0 interrupted iterations
largepayload_messaging   [  57% ] 25/25 VUs  17.0s/30.0s

running (0m18.0s), 25/25 VUs, 63369 complete and 0 interrupted iterations
largepayload_messaging   [  60% ] 25/25 VUs  18.0s/30.0s

running (0m19.0s), 25/25 VUs, 68260 complete and 0 interrupted iterations
largepayload_messaging   [  63% ] 25/25 VUs  19.0s/30.0s

running (0m20.0s), 25/25 VUs, 73156 complete and 0 interrupted iterations
largepayload_messaging   [  67% ] 25/25 VUs  20.0s/30.0s

running (0m21.0s), 25/25 VUs, 78024 complete and 0 interrupted iterations
largepayload_messaging   [  70% ] 25/25 VUs  21.0s/30.0s

running (0m22.0s), 25/25 VUs, 82853 complete and 0 interrupted iterations
largepayload_messaging   [  73% ] 25/25 VUs  22.0s/30.0s

running (0m23.0s), 25/25 VUs, 87716 complete and 0 interrupted iterations
largepayload_messaging   [  77% ] 25/25 VUs  23.0s/30.0s

running (0m24.0s), 25/25 VUs, 92498 complete and 0 interrupted iterations
largepayload_messaging   [  80% ] 25/25 VUs  24.0s/30.0s

running (0m25.0s), 25/25 VUs, 97287 complete and 0 interrupted iterations
largepayload_messaging   [  83% ] 25/25 VUs  25.0s/30.0s

running (0m26.0s), 25/25 VUs, 102010 complete and 0 interrupted iterations
largepayload_messaging   [  87% ] 25/25 VUs  26.0s/30.0s

running (0m27.0s), 25/25 VUs, 106723 complete and 0 interrupted iterations
largepayload_messaging   [  90% ] 25/25 VUs  27.0s/30.0s

running (0m28.0s), 25/25 VUs, 111533 complete and 0 interrupted iterations
largepayload_messaging   [  93% ] 25/25 VUs  28.0s/30.0s

running (0m29.0s), 25/25 VUs, 116370 complete and 0 interrupted iterations
largepayload_messaging   [  97% ] 25/25 VUs  29.0s/30.0s

running (0m30.0s), 25/25 VUs, 121171 complete and 0 interrupted iterations
largepayload_messaging   [ 100% ] 25/25 VUs  30.0s/30.0s
     ✓ [largepayload_messaging] status 200

     checks.........................: 100.00% ✓ 121220     ✗ 0     
     data_received..................: 1.2 GB  40 MB/s
     data_sent......................: 11 MB   364 kB/s
     http_req_blocked...............: avg=1.5µs   min=0s     med=1µs    max=1.82ms  p(90)=2µs    p(95)=4µs   
     http_req_connecting............: avg=36ns    min=0s     med=0s     max=529µs   p(90)=0s     p(95)=0s    
   ✓ http_req_duration..............: avg=4.63ms  min=1.26ms med=4.57ms max=32.37ms p(90)=6.34ms p(95)=6.97ms
       { expected_response:true }...: avg=4.63ms  min=1.26ms med=4.57ms max=32.37ms p(90)=6.34ms p(95)=6.97ms
     http_req_failed................: 0.00%   ✓ 0          ✗ 121220
     http_req_receiving.............: avg=28.58µs min=7µs    med=20µs   max=4.35ms  p(90)=47µs   p(95)=76µs  
     http_req_sending...............: avg=4.71µs  min=1µs    med=3µs    max=1.49ms  p(90)=7µs    p(95)=14µs  
     http_req_tls_handshaking.......: avg=0s      min=0s     med=0s     max=0s      p(90)=0s     p(95)=0s    
     http_req_waiting...............: avg=4.6ms   min=1.22ms med=4.54ms max=32.29ms p(90)=6.31ms p(95)=6.93ms
     http_reqs......................: 121220  4040.17592/s
     iteration_duration.............: avg=4.67ms  min=1.3ms  med=4.6ms  max=32.48ms p(90)=6.38ms p(95)=7.02ms
     iterations.....................: 121220  4040.17592/s
     vus............................: 25      min=1        max=25  
     vus_max........................: 25      min=25       max=25  
running (0m30.0s), 00/25 VUs, 121220 complete and 0 interrupted iterations
largepayload_messaging ✓ [ 100% ] 00/25 VUs  30s